Show / Hide Table of Contents
Class OpenMessage
Open message base class
Inheritance
System.Object
OpenObject
OpenMessage
ErrorMessage
InformationMessage
WarningMessage
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[KnownType(typeof(ErrorMessage))]
[KnownType(typeof(WarningMessage))]
[KnownType(typeof(InformationMessage))]
[DataContract]
public class OpenMessage : OpenObject
Constructors
Improve this Doc   View Source
OpenMessage()
Constructor
Declaration
public OpenMessage()
Properties
Improve this Doc   View Source
Description
Description of message
Declaration
[DataMember]
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
InnerMessage
Inner message
Declaration
public OpenMessage InnerMessage { get; set; }
Property Value
 Type |  Description
 OpenMessage
Improve this Doc   View Source
Message
Gets the Message
Declaration
public virtual string Message { get; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Number
Number of message
Declaration
[DataMember]
public MessageNumber Number { get; set; }
Property Value
 Type |  Description
 MessageNumber
Improve this Doc   View Source
Object
Affected object
Declaration
public OpenObject Object { get; set; }
Property Value
 Type |  Description
 OpenObject
Improve this Doc   View Source
PropertyName
Affected property name
Declaration
public string PropertyName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
PropertyValue
Gets the value of affected property
Declaration
public object PropertyValue { get; }
Property Value
 Type |  Description
 System.Object
Methods
Improve this Doc   View Source
Create(MessageNumber, OpenObject, String, String, OpenMessage)
Creating message
Declaration
public static OpenMessage Create(MessageNumber number, OpenObject openObject, string propertyName, string description, OpenMessage innerMessage = null)
Parameters
 Type |  Name |  Description
 MessageNumber |  number
Number of the message
 OpenObject |  openObject
Affected object
 System.String |  propertyName
Affected property
 System.String |  description
Description of the message
 OpenMessage |  innerMessage
Inner message
Returns
 Type |  Description
 OpenMessage
The created message or null if the number is not supported
 Improve this Doc
 View Source